var bankData = [
    {
        "id": "B000A7RDGT",
        "typecode": "160104",
        "address": "华鼎世家306号楼1层",
        "location": [
            "116.474316",
            "39.993870"
        ],
        "name": "中国银行(望京园支行)",
        "tel": "010-64741403"
    },
    {
        "id": "B000A87SK3",
        "typecode": "160104",
        "address": "阜通东大街12号宝能中心",
        "location": [
            "116.478652",
            "39.988049"
        ],
        "name": "中国银行(北京宝能中心支行)",
        "tel": "010-84765811"
    },
    {
        "id": "B0FFG732NR",
        "typecode": "160104",
        "address": "望京湖光中街1号(地铁15号线c出口、星巴克)",
        "location": [
            "116.467088",
            "39.997672"
        ],
        "name": "中国银行(望京科技园支行)",
        "tel": "010-64741503;010-64741002"
    },
    {
        "id": "B000A9UZDA",
        "typecode": "160104",
        "address": "望京街8号院2号楼(B座)2层201室",
        "location": [
            "116.482596",
            "39.993469"
        ],
        "name": "中国银行(利星广场支行)",
        "tel": "010-84760169;95566"
    },
    {
        "id": "B000A84AM0",
        "typecode": "160104",
        "address": "望京阜通东大街6号院4号楼方恒购物中心1层",
        "location": [
            "116.483691",
            "39.991257"
        ],
        "name": "中国银行(北京阜通路支行)",
        "tel": "010-84785367;010-84785357;010-84760176"
    },
    {
        "id": "B000A8WBCY",
        "typecode": "160104",
        "address": "望京西路甲50号1号楼1层",
        "location": [
            "116.458350",
            "39.983694"
        ],
        "name": "中国银行(北京望京西路支行)",
        "tel": "010-64795243;010-64795048"
    },
    {
        "id": "B000A84MEQ",
        "typecode": "160104",
        "address": "将台路6号丽都广场1层",
        "location": [
            "116.478029",
            "39.977270"
        ],
        "name": "中国银行(丽都饭店支行)",
        "tel": "010-64369865"
    },
    {
        "id": "B000A84B9L",
        "typecode": "160104",
        "address": "望京北路9号叶青大厦A座",
        "location": [
            "116.467873",
            "40.012059"
        ],
        "name": "中国银行(北京望京支行)",
        "tel": "010-64392600;010-64392056"
    },
    {
        "id": "B0FFIA2GZ8",
        "typecode": "160104",
        "address": "酒仙桥路乙21号国宾大厦3-4段1层",
        "location": [
            "116.489346",
            "39.972374"
        ],
        "name": "中国银行(将台路支行)",
        "tel": "010-64376166;95566"
    },
    {
        "id": "B000A7WTZ0",
        "typecode": "160108",
        "address": "阜通西大街望京西园4区416号楼",
        "location": [
            "116.472992",
            "39.995857"
        ],
        "name": "交通银行(北京望京西园支行)",
        "tel": "010-84719673;010-64713569"
    },
    {
        "id": "B000A470F1",
        "typecode": "160108",
        "address": "望京南湖中园K3区301号办公楼211楼",
        "location": [
            "116.462410",
            "40.000543"
        ],
        "name": "交通银行(望京南湖中园支行)",
        "tel": "010-84713883;010-64748541;010-95559"
    },
    {
        "id": "B0FFH5BYA5",
        "typecode": "160108",
        "address": "望京宏泰东街浦项中心B座",
        "location": [
            "116.487961",
            "39.998817"
        ],
        "name": "交通银行(北京望京东路支行)",
        "tel": "010-84294766;95559"
    },
    {
        "id": "B000A1C0D6",
        "typecode": "160108",
        "address": "酒仙桥路10号星城国际大厦1-2层",
        "location": [
            "116.490643",
            "39.980012"
        ],
        "name": "交通银行(酒仙桥支行)",
        "tel": "010-64350991;010-64354445;010-95559"
    },
    {
        "id": "B0FFFAHWS2",
        "typecode": "160107",
        "address": "花家地街1号",
        "location": [
            "116.469395",
            "39.985459"
        ],
        "name": "中国农业银行(将台路支行)",
        "tel": "010-64722757;010-64722971"
    },
    {
        "id": "B000A7Z1ZN",
        "typecode": "160107",
        "address": "望京街9号望京国际商业中心A座1层",
        "location": [
            "116.483007",
            "39.989928"
        ],
        "name": "中国农业银行(北京京顺支行)",
        "tel": "010-59203186"
    },
    {
        "id": "B000A4EFFB",
        "typecode": "160107",
        "address": "望京西园221号博泰大厦101室",
        "location": [
            "116.472554",
            "40.002173"
        ],
        "name": "中国农业银行(望盛园分理处)",
        "tel": "010-64789601;010-64789099"
    },
    {
        "id": "B000A87SEW",
        "typecode": "160107",
        "address": "湖光北街9号旺角购物广场",
        "location": [
            "116.463340",
            "40.002034"
        ],
        "name": "中国农业银行(旺角支行)",
        "tel": "010-84957673;010-64411425"
    },
    {
        "id": "B000A9N4IB",
        "typecode": "160107",
        "address": "望京西路53号1层101",
        "location": [
            "116.456930",
            "39.991724"
        ],
        "name": "中国农业银行(南湖中园支行)",
        "tel": "010-64790975"
    },
    {
        "id": "B000A85KT3",
        "typecode": "160107",
        "address": "广顺北大街19号1层(望京商业街北区A01)",
        "location": [
            "116.466544",
            "40.009076"
        ],
        "name": "中国农业银行(北京望京支行)",
        "tel": "010-64711745;010-64710024"
    },
    {
        "id": "B000A85CIL",
        "typecode": "160105",
        "address": "广顺北大街33号院1号楼1层101室",
        "location": [
            "116.467302",
            "39.994495"
        ],
        "name": "中国工商银行(北京广顺支行)",
        "tel": "010-84725768"
    },
    {
        "id": "B000A80EHF",
        "typecode": "160105",
        "address": "望京西园3区315号楼1层",
        "location": [
            "116.475331",
            "39.998166"
        ],
        "name": "中国工商银行(望京新城支行)",
        "tel": "010-84713054;010-95588"
    },
    {
        "id": "B000A7VSLF",
        "typecode": "160105",
        "address": "望京中环南路9号望京大厦内B座首层(近花家地街)",
        "location": [
            "116.469845",
            "39.986096"
        ],
        "name": "中国工商银行(北京四元桥支行)",
        "tel": "010-64729493"
    },
    {
        "id": "B000A8VPQQ",
        "typecode": "160105",
        "address": "广顺南大街16号院新世界百货望京店2层",
        "location": [
            "116.479667",
            "39.987246"
        ],
        "name": "中国工商银行(北京嘉美风尚支行)",
        "tel": "010-84763842"
    },
    {
        "id": "B000A83GHV",
        "typecode": "160105",
        "address": "广顺北大街南湖东园一区101号楼",
        "location": [
            "116.466700",
            "40.004576"
        ],
        "name": "中国工商银行(北京南湖东园支行)",
        "tel": "010-64751706"
    },
    {
        "id": "B000A88E4Q",
        "typecode": "160105",
        "address": "南湖西园甲205号楼1层09、10、11、15",
        "location": [
            "116.457002",
            "39.996600"
        ],
        "name": "中国工商银行(京城支行)",
        "tel": "010-52039080;95588"
    },
    {
        "id": "B0FFFKRREX",
        "typecode": "160105",
        "address": "酒仙桥路4号",
        "location": [
            "116.490396",
            "39.985179"
        ],
        "name": "中国工商银行(北京大山子支行)",
        "tel": "010-64372971;95588"
    },
    {
        "id": "B0FFHRKJBT",
        "typecode": "160105",
        "address": "将台路与芳园西路交叉口东北100米",
        "location": [
            "116.484267",
            "39.976824"
        ],
        "name": "中国工商银行(北京高家园支行)",
        "tel": ''
    },
    {
        "id": "B000A75CDB",
        "typecode": "160105",
        "address": "利泽中园105号",
        "location": [
            "116.473296",
            "40.012061"
        ],
        "name": "中国工商银行(北京科技园区支行)",
        "tel": "010-64390921"
    },
    {
        "id": "B000A314CF",
        "typecode": "160105",
        "address": "酒仙桥路甲10星城国际大厦",
        "location": [
            "116.490418",
            "39.979154"
        ],
        "name": "中国工商银行(北京望京支行)",
        "tel": "010-64337412;010-64368822"
    },
    {
        "id": "B000A0D68C",
        "typecode": "160105",
        "address": "将台路芳园里37号楼",
        "location": [
            "116.484236",
            "39.971210"
        ],
        "name": "中国工商银行(将台路支行)",
        "tel": "010-64372586;95588"
    },
    {
        "id": "B000A80EER",
        "typecode": "160106",
        "address": "望京西园4区423号楼1层",
        "location": [
            "116.469082",
            "39.995867"
        ],
        "name": "中国建设银行(北京望京西园支行)",
        "tel": "010-64703357"
    },
    {
        "id": "B000A9MXGZ",
        "typecode": "160106",
        "address": "阜通西大街11号合生·麒麟新天地F1层",
        "location": [
            "116.477715",
            "39.996782"
        ],
        "name": "中国建设银行(阜安西路支行)",
        "tel": "010-57389895;95533"
    },
    {
        "id": "B000A7RBKA",
        "typecode": "160106",
        "address": "花家地街花家地北里1号楼(近望花路)",
        "location": [
            "116.468094",
            "39.986178"
        ],
        "name": "中国建设银行(北京望京支行)",
        "tel": "010-64730380"
    },
    {
        "id": "B000A84PXX",
        "typecode": "160106",
        "address": "望京西园二区211号",
        "location": [
            "116.468248",
            "40.004405"
        ],
        "name": "中国建设银行(北大街支行)",
        "tel": "010-64747146"
    },
    {
        "id": "B000A85EGQ",
        "typecode": "160106",
        "address": "南湖西园125号",
        "location": [
            "116.456417",
            "39.997367"
        ],
        "name": "中国建设银行(南湖支行)",
        "tel": "010-64718981"
    },
    {
        "id": "B0FFH6SCXK",
        "typecode": "160106",
        "address": "望京西路甲50号",
        "location": [
            "116.458323",
            "39.984238"
        ],
        "name": "中国建设银行(北京花家地支行)",
        "tel": "010-64735351"
    },
    {
        "id": "B000A5953E",
        "typecode": "160106",
        "address": "酒仙桥路2号",
        "location": [
            "116.490224",
            "39.986655"
        ],
        "name": "中国建设银行(北京电子城科技园支行)",
        "tel": "010-64343061;010-64342801"
    },
    {
        "id": "B0FFILXHWA",
        "typecode": "160106",
        "address": "启阳路金辉大厦附近",
        "location": [
            "116.488889",
            "40.003144"
        ],
        "name": "中国建设银行(金辉支行)(装修中)",
        "tel": "95533"
    },
    {
        "id": "B000A83845",
        "typecode": "160109",
        "address": "南湖南路15号院甲1号",
        "location": [
            "116.462521",
            "39.990145"
        ],
        "name": "招商银行(北京望京支行)",
        "tel": "010-64799870;010-64799887;010-64799886"
    },
    {
        "id": "B0FFGJ2WUN",
        "typecode": "160109",
        "address": "望京东园523号融科望京中心A座101",
        "location": [
            "116.483060",
            "39.998029"
        ],
        "name": "招商银行(北京望京融科支行)",
        "tel": "010-64719976"
    },
    {
        "id": "B000A80TDH",
        "typecode": "160109",
        "address": "望京西园134号炫彩嘉轩1层",
        "location": [
            "116.478172",
            "40.002768"
        ],
        "name": "招商银行(北京望京西园支行)",
        "tel": "010-64789785;010-95555"
    },
    {
        "id": "B0FFFAH8Y4",
        "typecode": "160109",
        "address": "望京西路316号",
        "location": [
            "116.458017",
            "39.996514"
        ],
        "name": "招商银行(望京西路支行)",
        "tel": "010-84710641;010-64728174"
    },
    {
        "id": "B0FFFAH39N",
        "typecode": "160109",
        "address": "利泽西街8号院1号楼1层",
        "location": [
            "116.461942",
            "40.008114"
        ],
        "name": "招商银行(望京利泽支行)",
        "tel": "010-84676942;010-84676894"
    },
    {
        "id": "B000A85NNF",
        "typecode": "160111",
        "address": "广顺北大街33号院-1号楼福码大厦B座1层102室",
        "location": [
            "116.467568",
            "39.995313"
        ],
        "name": "中信银行(北京福码大厦支行)",
        "tel": "010-95558;010-84729727"
    },
    {
        "id": "B000A43F10",
        "typecode": "160111",
        "address": "利泽中二路208号众运大厦B座1层",
        "location": [
            "116.470434",
            "40.011901"
        ],
        "name": "中信银行(望京支行)",
        "tel": "010-64391220;95558"
    },
    {
        "id": "B000A4EDC0",
        "typecode": "160111",
        "address": "酒仙桥路14号兆维大厦1层",
        "location": [
            "116.490394",
            "39.974574"
        ],
        "name": "中信银行(北京酒仙桥支行)",
        "tel": "010-64319780;95558"
    },
    {
        "id": "B000A80EFV",
        "typecode": "160139",
        "address": "望京西园4区416号楼1层",
        "location": [
            "116.472926",
            "39.995615"
        ],
        "name": "中国邮政储蓄银行(望京西园营业所)",
        "tel": "010-64712340"
    },
    {
        "id": "B000A836FT",
        "typecode": "160139",
        "address": "花家地北里1号楼",
        "location": [
            "116.467569",
            "39.986735"
        ],
        "name": "中国邮政储蓄银行(花家地支行)",
        "tel": "010-64737340"
    },
    {
        "id": "B0FFGB08JQ",
        "typecode": "160139",
        "address": "南湖南路15号院附近",
        "location": [
            "116.462610",
            "39.991184"
        ],
        "name": "中国邮政储蓄银行(南湖南路)(装修中)",
        "tel": "95580"
    },
    {
        "id": "B000A83IY9",
        "typecode": "160139",
        "address": "南湖东园201号楼",
        "location": [
            "116.464087",
            "40.000887"
        ],
        "name": "中国邮政储蓄银行(南湖东园营业所)",
        "tel": ''
    },
    {
        "id": "B000A83EMQ",
        "typecode": "160139",
        "address": "望京西园1区120号楼",
        "location": [
            "116.473634",
            "40.004443"
        ],
        "name": "中国邮政储蓄银行(望京支行)",
        "tel": ''
    },
    {
        "id": "B0FFG73C69",
        "typecode": "160139",
        "address": "大山子北里35号楼",
        "location": [
            "116.487853",
            "39.984170"
        ],
        "name": "中国邮政储蓄银行(大山子北里营业所)",
        "tel": "010-64330251;010-64373873"
    },
    {
        "id": "B0FFFEINC3",
        "typecode": "160139",
        "address": "酒仙桥路13号",
        "location": [
            "116.489345",
            "39.979480"
        ],
        "name": "中国邮政储蓄银行(大山子支行)",
        "tel": ''
    }
]
